tutorials/dbsBiofilmPimpleFoam/2d-streamer/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//defaultFieldValues ( volScalarFieldValue M 0 );

regions
(

 // cellToCell {
 //   set inoculum;
 //   fieldValues ( volScalarFieldValue M 0.8 );
 // }
 
 cylinderToCell {
   p1       (0.00048384 6.048e-05 -10); 
   p2       (0.00048384 6.048e-05  10);
   radius   1.89e-05;
   fieldValues ( volScalarFieldValue M 0.8 );
 }
 
 );

// ************************************************************************* //
